#+TITLE: Regular expressions
#+SETUPFILE: setup.org

* Matching patterns

Now that we have defined that pattern, we can search for it in the
string.

#+BEGIN_SRC python :session
  import re

  match = re.search(pattern, info)
  print(match)
#+END_SRC

#+RESULTS[266d0ce7336b88b120321fdcde30d9b239a746d7]:
: <_sre.SRE_Match object; span=(29, 47), match='gene_name "ZNF510"'>

<<nogroup>>The =search= function returns a match object (or =None= if
a match isn't found). From the output, we see that we have an object,
but how do we access the match? If you are in IPython, you can type
=match.<TAB>= to see your options. Use a =?= after some of them to get
more information. The description of =match.group?= seems promising.
It tells us that giving =0= as an argument will return the entire
match. Let's try.

#+BEGIN_SRC python :session
  print(match.group(0))
#+END_SRC

#+RESULTS[c229de8a5908e3b6542ef0e88e26f764512d027e]:
: gene_name "ZNF510"

Well, still not exactly what we want. It would be nice to get the gene
name that is inside the quotes.

* Pulling out groups

The trick is putting parentheses around the text we want to capture.

#+BEGIN_SRC python :session
  pattern = r'gene_name "(\w+)"'
#+END_SRC

#+RESULTS[808a215cf53865a0c7b1fb7772ce654e0f6004af]:

Now we can access the captured text as a group. We know from the
[[nogroup][previous matching example]] that passing =0= to =match.group= gives that
entire match string. After this default group, there are as many
additional groups as parentheses sets in the pattern. So in the first
example, there were no more groups. In the second pattern we created, we
defined a group with parentheses, so there is one more group in addition
to the default group that corresponds to the entire match.

#+BEGIN_SRC python :session
  match = re.search(pattern, info)
  print(match.group(0))
  print(match.group(1))
#+END_SRC

#+RESULTS[8c710489bb28109ebbc7da5628fa34e232d592a5]:
: gene_name "ZNF510"
: ZNF510

Here is the complete example extracting out the gene name.

#+BEGIN_SRC python
  import re

  info = 'gene_id "ENSG00000081386.8"; gene_name "ZNF510"'
  pattern = r'gene_name "(\w+)"'
  gene_name = re.search(pattern, info).group(1)
  print(gene_name)
#+END_SRC

#+RESULTS[226e9cb8ca65edda4ff5c0941a41937fed84d6f7]:
: ZNF510

